<?php

/**
 * This file is a quick fix for zhConversion.php.
 * By doing so, zhConversion.php can be maintained by Wikimedia.
 * @author 小斐 <admin@2d-gate.org>
 */

// 簡轉繁
$zh2Hant_fix = array(
'⋯'=>'…',
'一昧'=>'一味',
'了然並'=>'了然並', // 然並卵
'了然後'=>'了然後',
'了然而'=>'了然而',
'休克死'=>'休克死',
'保险柜'=>'保險櫃',
'克拉克'=>'克拉克',
'关注'=>'關注',
'净'=>'淨',
'凈'=>'淨',
'几淨'=>'几淨',
'凱旋回'=>'凱旋回',
'别强'=>'别强',
'卧'=>'臥',
'发卷子'=>'發卷子',
'发呆'=>'發呆',
'啓'=>'啟',
'啮'=>'嚙',
'喂'=>'喂',
'墻'=>'牆',
'尓'=>'爾',
'尔'=>'爾',
'慘淡'=>'慘澹',
'托附近'=>'托附近',
'抵觸'=>'牴觸',
'拚'=>'拼',
'拮據'=>'拮据',
'挂'=>'掛',
'挂号'=>'掛號',
'挂图'=>'掛圖',
'挂帅'=>'掛帥',
'挂彩'=>'掛彩',
'挂念'=>'掛念',
'挂车'=>'掛車',
'掌柜'=>'掌櫃',
'昵'=>'暱',
'柜上'=>'櫃上',
'柜台'=>'櫃臺',
'柜子'=>'櫃子',
'歎'=>'嘆',
'污'=>'汙',
'淨几'=>'淨几',
'清析'=>'清晰',
'游騎'=>'遊騎',
'爲'=>'為',
'瓮'=>'甕',
'着'=>'著',
'算发'=>'算發',
'粘'=>'黏',
'綫'=>'線',
'纔'=>'才',
'脣'=>'唇',
'腌'=>'醃',
'舘'=>'館',
'葉韻'=>'叶韻',
'葯'=>'藥',
'賬'=>'帳',
'鉆'=>'鑽',
'閑'=>'閒',
'關注'=>'關注',
'飈'=>'飆',
'駡'=>'罵',
'鶏'=>'雞',
'麽'=>'麼',
'黑闇'=>'黑暗',
'黨項'=>'党項',
// fix Japanese
'弁当' => '弁当',
// don't convert punctuations
'‘'=>'‘',
'’'=>'’',
'“'=>'“',
'“'=>'“',
'”'=>'”',
'”'=>'”',
// WTF
'’s '=>'’s ',
);

// 繁轉簡
$zh2Hans_fix = array(
'剪貼簿'=>'剪贴板',
'智慧型手機'=>'智能电话',
'智慧手機'=>'智能电话',
'生命跡象'=>'生命体征',
'範例'=>'示例',
'訊息'=>'信息',
'讯息'=>'信息',
'預設值'=>'默认值',
// don't convert punctuations
'「'=>'「',
'」'=>'」',
'『'=>'『',
'』'=>'』',
'｢'=>'｢',
'｣'=>'｣',
);

// 轉為台灣用語（假定輸入為繁）
$zh2TW_fix = array(
'公布什'=>'公布什',
'完結他'=>'完結他',
'宣布什'=>'宣布什',
'打算子'=>'打算子',
'智能電話'=>'智慧手機',
'本地硬盤'=>'本機硬碟',
'比特率'=>'位元率',
'沙囊'=>'砂囊',
'生命體徵'=>'生命跡象',
'發布什'=>'發布什',
'盤算子'=>'盤算子',
'禁煙火'=>'禁煙火',
'終結他'=>'終結他',
'計算子'=>'計算子',
'踏腳石'=>'墊腳石',
'魔道士'=>'魔導士',
);

// 轉為香港用語（假定輸入為繁）
$zh2HK_fix = array(
'出租車'=>'的士',
'對不起'=>'對不住',
'特地'=>'特意',
'計程車'=>'的士',
'這次'=>'今次',
'零用錢'=>'零花錢',
);

// 轉為大陸用語（假定輸入為簡）
$zh2CN_fix = array(
);
